app/views/products/displays_graphic_lcd.html.erb

SELECT "product_displays_intgraph".* FROM "product_displays_intgraph" ORDER BY sort
---
                      </tr>
              <% ProductDisplaysIntgraph.to_display.each do |product| %>