app/views/products/displays_tft_lcd_color.html.erb

                          </tr>
          <% ProductDisplaysTftmodule.to_display.each do |product| %>
---
SELECT "product_displays_tftmodules".* FROM "product_displays_tftmodules" ORDER BY sort