app/views/products/monitors_tft_lcd_color.html.erb

                          </tr>
            <% ProductDisplaysTftmonitor.to_display.each do |product| %>
---
SELECT "product_displays_tftmonitors".* FROM "product_displays_tftmonitors" ORDER BY sort